# GetOrdinateDimensionSetting Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionType..::..GetOrdinateDimensionSetting Method
DimensionType Class See Also
---
Gets the ordinate dimension settings for this DimensionType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public OrdinateDimensionSetting GetOrdinateDimensionSetting()
```

Visual Basic
---
```text
Public Function GetOrdinateDimensionSetting As OrdinateDimensionSetting
```

Visual C++
---
```text
public:
OrdinateDimensionSetting^ GetOrdinateDimensionSetting()
```

# ### Return Value
The ordinate dimension settings.
# See Also
DimensionType Class
Autodesk.Revit.DB Namespace